about.org
#+title: 废石居士自传 
#+author: liangzid
#+FILETAGS: noshow 
#+date: Fri Sep 10 11:27:52 2021
#+email: 2273067585@qq.com 

梁子者，山东某县人也。时其父东北还乡，路遇丘陵山丛，人言“山之梁子”，故名之曰梁子也。梁子好文学，爱撰文，每有灵感则奋笔小说，欣欣然不得止，平常好搬弄笔墨，淋漓词话，也常忧伤感怀，可谓文人通病也。后入大学，研机器之控制、电脑之编撰、智能之人修，至今已有五年也。感《红楼梦》之语，便自名曰废石居士。废石者，非非才也，非材也。以此为人生之志。

或可以下列属性观之：

+ 写小说；
+ 写诗（包括现代诗和古代诗）
+ 混乱的书籍
  - 小说风格上，推崇加缪，尤以《鼠疫》为重；
  — 西方哲学，深受海德格尔影响；
  - 推崇中国古代哲学，儒释道均对梁子产生了重大影响。目前看最大的是程朱理学。常读朱子《四书章句集注》、《金刚经》，最近在读《荀子集解》。
  — 共产主义者。
+ emacs新手（from 2020）
+ 乒乓球、羽毛球我不怕；
+ 每天都跑步；
+ EU4熟练玩家, LOL退坑，WAR3 RA2可以玩一玩，YGO菜鸡；
+ 现居西安，继续上学；
+ 恋爱中……未婚；
+ 萧；

联系。。：

+ [[https://www.zhihu.com/people/li-xun-huan-47-95][知乎]]
+ [[https://space.bilibili.com/44654770?spm_id_from=333.1007.0.0][bilibili]]
+ [[https://www.douban.com/people/155144115/][豆瓣]]
+ [[https://weibo.com/6062672223/profile?rightmod=1&wvr=6&mod=personinfo][微博]]
+ 2273067585@qq.com
+ 微信：frostliangzi


+ research page [[file:research.org][HERE.]]
