about.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-17 Wed 19:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>废石居士自传</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liangzid" />
<link rel="stylesheet" type="text/css" href="~/liangzid.github.io/notes/css/worg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">废石居士自传</h1>
<p>
梁子者，山东某县人也。时其父东北还乡，路遇丘陵山丛，人言“山之梁子”，故名之曰梁子也。梁子好文学，爱撰文，每有灵感则奋笔小说，欣欣然不得止，平常好搬弄笔墨，淋漓词话，也常忧伤感怀，可谓文人通病也。后入大学，研机器之控制、电脑之编撰、智能之人修，至今已有五年也。感《红楼梦》之语，便自名曰废石居士。废石者，非非才也，非材也。以此为人生之志。
</p>

<p>
或可以下列属性观之：
</p>

<ul class="org-ul">
<li>写小说；</li>
<li>写诗（包括现代诗和古代诗）</li>
<li><p>
混乱的书籍
</p>
<ul class="org-ul">
<li>小说风格上，推崇加缪，尤以《鼠疫》为重；</li>
</ul>
<p>
— 西方哲学，深受海德格尔影响；
</p>
<ul class="org-ul">
<li>推崇中国古代哲学，儒释道均对梁子产生了重大影响。目前看最大的是程朱理学。常读朱子《四书章句集注》、《金刚经》，最近在读《荀子集解》。</li>
</ul>
<p>
— 共产主义者。
</p></li>
<li>emacs新手（from 2020）</li>
<li>乒乓球、羽毛球我不怕；</li>
<li>每天都跑步；</li>
<li>EU4熟练玩家, LOL退坑，WAR3 RA2可以玩一玩，YGO菜鸡；</li>
<li>现居西安，继续上学；</li>
<li>恋爱中……未婚；</li>
<li>萧；</li>
</ul>

<p>
联系。。：
</p>

<ul class="org-ul">
<li><a href="https://www.zhihu.com/people/li-xun-huan-47-95">知乎</a></li>
<li><a href="https://space.bilibili.com/44654770?spm_id_from=333.1007.0.0">bilibili</a></li>
<li><a href="https://www.douban.com/people/155144115/">豆瓣</a></li>
<li><a href="https://weibo.com/6062672223/profile?rightmod=1&amp;wvr=6&amp;mod=personinfo">微博</a></li>
<li>2273067585@qq.com</li>
<li>微信：frostliangzi</li>
</ul>


<ul class="org-ul">
<li>research page <a href="research.html">HERE.</a></li>
</ul>
</div>
<div id="postamble" class="status">
<p class="date">Date: Fri Sep 10 11:27:52 2021</p>
<p class="author">Author: liangzid</p>
<p class="date">Created: 2021-11-17 Wed 19:52</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
